{
"Apple___Apple_scab": "Apple Scab is a fungal disease affecting apple trees, caused by the pathogen Venturia inaequalis. It primarily targets the leaves and fruit, leading to unsightly, dark, velvety lesions that reduce the fruit's market quality and make it unsuitable for consumption in severe cases. The disease thrives in cool, wet conditions, often appearing in early spring when rain splashes fungal spores from fallen leaves onto young, developing leaves and fruits.The symptoms of apple scab begin as olive-green to brown spots on leaves, which may later turn black and become cracked. Infected fruits may become misshapen and may drop prematurely, impacting yields significantly. Control measures include planting resistant varieties, removing and disposing of fallen leaves (to reduce spore levels), and applying fungicides at strategic times to interrupt the pathogen's life cycle.", 
"Apple___Black_rot" : "Apple Black Rot is a fungal disease caused by Botryosphaeria obtusa, affecting apple trees and other fruit-bearing plants. It is characterized by dark, sunken lesions on the fruit, leaves, and bark. The disease often starts with leaf spots, which are circular and dark brown with a purple halo. On the fruit, black rot causes round, dark, concentric rings that make apples look scorched and reduce their quality.Black rot typically thrives in warm, humid environments, spreading through spores that overwinter in infected plant debris or cankers on tree branches. These spores are dispersed by rain, wind, or insects, infecting new tissue in spring and summer. The disease can significantly reduce crop yield and tree vigor if left unmanaged. Effective control strategies include pruning out infected wood, removing fallen fruit and leaves, and applying fungicides at key stages in the growing season. Additionally, selecting resistant apple varieties and ensuring proper tree nutrition and ventilation can help minimize infection.", 
"Apple___Cedar_apple_rust" : "Cedar Apple Rust is a fungal disease caused by Gymnosporangium juniperi-virginianae, affecting apple trees and various juniper species, especially Eastern red cedar (Juniperus virginiana). This disease requires both apple and cedar trees to complete its complex life cycle, moving between these hosts to survive and spread.Symptoms on apple trees include bright orange or yellow spots on leaves, which later develop dark, raised structures that release spores. Infected fruit may also display deformed lesions, making it unmarketable. In spring, cedar trees host the distinctive, brownish galls that produce orange, jelly-like tendrils, releasing spores that can infect nearby apple trees.Cedar apple rust thrives in warm, humid weather, and infection is most likely during wet spring months. Control methods include planting disease-resistant apple varieties, removing nearby junipers to disrupt the pathogen's life cycle, and applying fungicides to apple trees at critical points in early spring. Pruning infected branches on both host types can also help reduce disease spread.", 
"Apple___healthy" : "Healthy Apple Trees exhibit vibrant, green foliage, strong branches, and well-formed fruits free from blemishes or disease symptoms. Healthy leaves are free of spots, discoloration, or curling, while fruit should be firm, smooth, and without signs of rot, scabs, or lesions. A thriving apple tree will show consistent growth each season, producing new shoots and flowers, which lead to a robust fruit yield.Proper care practices contribute to the health of apple trees, including adequate sunlight, well-drained soil, and regular watering, especially during dry periods. Pruning encourages air circulation, reducing the risk of fungal diseases, and removing dead or diseased branches strengthens the tree overall. Additionally, maintaining a balanced nutrient supply through fertilization, applying mulch to retain soil moisture, and protecting against pests and diseases are key to keeping apple trees healthy. A proactive approach, such as planting disease-resistant varieties and monitoring for early signs of infection, helps ensure apple trees stay strong and productive year after year.", 
"Blueberry___healthy" : "Healthy Blueberry Plants are characterized by vibrant green leaves, strong stems, and abundant, well-formed fruit. The foliage should be deep green, with no signs of yellowing, wilting, or browning, which can indicate nutrient deficiencies or pest problems. The stems should be sturdy, and the plant should show vigorous growth, with new shoots emerging in the spring. Healthy blueberries will have plump, firm berries that ripen evenly, free from spots, rot, or pests.To maintain the health of blueberry plants, they require well-drained, acidic soil (pH between 4.5 and 5.5), full sunlight for at least 6–8 hours a day, and regular watering, especially during dry spells. Mulching helps retain moisture, suppress weeds, and maintain soil acidity. Fertilization with a balanced fertilizer suitable for acid-loving plants ensures proper growth and fruit production. Pruning in late winter or early spring removes old, unproductive wood and encourages new growth, leading to better yields. A proactive approach to pest control, such as using netting to protect berries from birds and monitoring for common blueberry pests like aphids, can help maintain a healthy plant.", 
"Cherry_(including_sour)___Powdery_mildew" : "Powdery Mildew on cherry trees, including sour cherries, is a fungal disease caused by Podosphaera clandestina. This disease affects both sweet and sour cherry trees, typically showing up as a white, powdery coating on the upper surfaces of leaves, flowers, and young shoots. As the disease progresses, the affected tissues may become distorted, and the leaves can yellow, curl, or even drop prematurely. Infected flowers may fail to set fruit, reducing the yield, while severe cases can lead to stunted growth and weakened trees.Powdery mildew thrives in warm, dry conditions with high humidity, often appearing in spring or early summer. The fungus spreads through airborne spores that are easily carried by the wind to new trees or parts of the same tree. If left unchecked, it can severely impact tree health and fruit production.Control methods for powdery mildew on cherry trees include selecting resistant varieties, improving air circulation around the tree through proper pruning, and applying fungicides, particularly during the early stages of infection. Removing infected leaves and debris helps reduce the fungal load, and ensuring proper tree care, such as adequate watering and nutrient management, can also promote resistance to the disease.", 
"Cherry_(including_sour)___healthy" : "Healthy Cherry Trees (including sour cherry varieties) exhibit robust growth, vibrant green foliage, and strong, productive branches. The leaves should be free from spots, yellowing, or wilting, which can indicate nutrient deficiencies or pest problems. Healthy trees will also produce abundant, firm cherries, with no signs of rot, cracking, or blemishing.To maintain the health of cherry trees, proper care is essential. These trees thrive in full sun, requiring at least 6 hours of direct sunlight per day. The soil should be well-drained and slightly acidic, with a pH between 6.0 and 7.0. Regular watering, particularly during dry periods, ensures strong growth, but the soil must not remain waterlogged, as cherries are prone to root rot in soggy conditions.Pruning is important for maintaining air circulation and removing dead or diseased wood. This practice helps prevent fungal infections and encourages better fruit production. Additionally, fertilizing cherry trees with a balanced fertilizer in early spring supports healthy growth and fruit set. Regular monitoring for pests and diseases, such as aphids or powdery mildew, allows for early intervention and helps keep the tree strong and productive. With the right care, healthy cherry trees will produce abundant and high-quality fruit year after year.", 
"Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot" : "Cercospora Leaf Spot (Gray Leaf Spot) on corn (maize) is a fungal disease caused by Cercospora zeae-maydis. This disease primarily affects the leaves of corn plants, and its characteristic symptoms include elongated, dark gray or brown lesions with a light-colored center. These lesions often have a yellow halo, and they can merge, causing large areas of leaf tissue to die. As the disease progresses, infected leaves lose their green color, leading to premature senescence and a reduction in photosynthesis, which impacts overall plant vigor and yield.Gray leaf spot typically appears during warm, humid weather, especially during the late vegetative and early reproductive stages of corn growth. The fungus spreads through airborne spores, and once the lesions form, it can quickly infect other parts of the plant. This disease can cause significant yield loss, particularly in susceptible corn varieties.Control measures for gray leaf spot include planting resistant varieties, practicing crop rotation to reduce inoculum build-up, and managing crop residue to limit fungal survival. Fungicide applications, particularly during periods of high humidity and when the disease is actively spreading, can also help reduce disease pressure. Proper field management, such as maintaining good plant spacing for air circulation, can reduce the chances of infection. Early identification and management are key to minimizing the impact of Cercospora leaf spot on corn production.", 
"Corn_(maize)___Common_rust_" : "Common Rust on corn (maize) is a fungal disease caused by Puccinia sorghi, which affects both sweet and field corn. The disease is characterized by the appearance of small, round, reddish-brown pustules (also called sori) on the upper surfaces of leaves, which may later turn darker and burst open to release orange-yellow spores. These pustules can spread rapidly during warm, humid weather, particularly in the early and mid-growing seasons. As the disease progresses, infected leaves may become yellow and necrotic, leading to a reduction in photosynthesis, which impacts the overall health of the plant and reduces grain yield.Common rust typically thrives in wet, warm conditions, and the fungus is spread by windborne spores, which can travel long distances to infect new plants. While common rust is less damaging than some other corn diseases, severe infections can cause significant yield loss, especially in susceptible varieties or when the disease is not controlled.Management of common rust involves planting resistant or tolerant corn varieties, practicing crop rotation, and removing infected plant residues. Fungicide applications may also be effective, particularly in fields where rust pressure is high or during periods of favorable weather for disease development. Timely application of fungicides during early disease stages can help protect the plants from significant damage.", 
"Corn_(maize)___Northern_Leaf_Blight" : "Northern Leaf Blight (NLB) on corn (maize) is a fungal disease caused by Exserohilum turcicum. It is one of the most destructive diseases of corn, especially in regions with humid, warm conditions. Northern leaf blight is characterized by large, elongated lesions on the leaves, which begin as light green to tan spots and eventually turn dark brown or grayish. These lesions can grow and merge, causing significant defoliation. As the disease progresses, it can affect the plant’s ability to photosynthesize, leading to stunted growth, reduced ear size, and lower yields.The disease typically starts in the lower leaves and works its way upward. It is favored by warm, wet weather, and the fungus overwinters in corn residue from previous crops, spreading to new plants via windborne spores. Northern leaf blight can cause severe damage during the later stages of growth, particularly in susceptible corn hybrids.Management strategies for Northern leaf blight include planting resistant corn varieties, rotating crops to reduce the buildup of fungal spores in the soil, and properly managing corn residue to minimize inoculum. Fungicide applications can also be used during periods of high disease pressure, especially if infection is detected early in the growing season. Good field management practices, such as maintaining proper plant spacing to ensure good air circulation, can also help reduce the severity of the disease.", 
"Corn_(maize)___healthy" : "Healthy Corn (Maize) plants are characterized by strong, vigorous growth, with tall, upright stalks and vibrant green leaves. The leaves should be smooth, free from spots, discoloration, or wilting, and the plant should display no signs of pest damage or disease. Healthy corn plants will also have well-formed, uniform ears and strong tassels, indicating good pollination. The plant's roots should be extensive and deep, allowing it to absorb nutrients and water effectively.For optimal health, corn requires full sun (at least 6 hours per day) and well-drained, fertile soil rich in organic matter. It thrives in slightly acidic to neutral soil (pH 5.8 to 7.0) and needs regular watering, especially during dry periods, but should not be overwatered to avoid root rot. Fertilization with nitrogen-rich fertilizers supports healthy leaf and stalk growth, while proper crop rotation helps prevent nutrient depletion and the buildup of soilborne pathogens.Pruning isn't typically necessary for corn, but it’s important to remove any weeds that may compete for nutrients and water. Proper field management, such as ensuring good plant spacing for air circulation and implementing pest and disease monitoring, can prevent common issues like fungal infections, aphid infestations, and other diseases. Healthy corn plants are more resistant to these issues and are better equipped to produce high yields.", 
"Grape___Black_rot" : "Black Rot on grapes is a fungal disease caused by Guignardia bidwellii. This disease affects both grapevines and their fruit, leading to severe yield loss if left unchecked. Black rot typically begins with small, round lesions on the leaves, which are initially light brown to dark purple, and later expand to form large, irregular, necrotic spots. These spots are often surrounded by a yellow halo. On the fruit, black rot causes black, sunken lesions that result in shriveled, decayed berries, making them unmarketable.The disease thrives in warm, humid conditions and spreads rapidly during wet weather. Spores are dispersed by rain, wind, and insects, and they infect the leaves, stems, and fruit. Infected fruit may shrivel, become mummified, and fall prematurely, significantly affecting both quality and yield.Management of black rot involves the use of resistant grape varieties, timely application of fungicides, and maintaining good vineyard hygiene. Pruning and removing infected leaves and fruit, as well as managing irrigation to avoid excessive moisture on the plant, can reduce the spread of the fungus. Proper airflow and spacing between vines also help minimize humidity, creating an environment less favorable for disease development. Additionally, managing weed growth and fallen fruit is essential to prevent fungal spores from overwintering in the vineyard.", 
"Grape___Esca_(Black_Measles)" :"Esca (Black Measles) is a serious and destructive fungal disease of grapevines caused by a complex of fungi, including Phaeomoniella chlamydospora and Phaeoacremonium spp.. The disease is most commonly seen in older vines and can lead to significant crop loss and vineyard decline. The symptoms of Esca are most prominent during the grapevine's fruiting stage, with the disease causing the leaves to develop dark, irregular necrotic spots, often accompanied by a yellowing of the surrounding tissue. These leaf lesions resemble measles, giving rise to the disease's alternate name, Black Measles.As the disease progresses, infected wood and canes develop internal necrosis, which weakens the vine and can lead to sudden vine death, particularly in hot weather or during stress periods. The fruit of infected vines may show a range of symptoms, from discoloration to shriveling and premature dropping. In severe cases, the vines may show a sudden, dramatic decline, a phenomenon known as sudden death syndrome.Esca is primarily spread through infected pruning tools, rain, and insects. Fungal spores can infect the vine through wounds, typically caused by pruning or other mechanical damage. Management of Esca is challenging, as there are no direct cures once the vine is infected. Preventive measures include selecting resistant varieties, practicing good vineyard hygiene (such as sanitizing pruning tools between cuts), and ensuring proper vine training and canopy management to minimize mechanical damage. Regular inspection of the vines for early signs of the disease can help in removing infected wood and reducing further spread. Additionally, maintaining optimal vine health through proper nutrition and irrigation can make the vines more resilient to infection.", 
"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)" : "Leaf Blight (Isariopsis Leaf Spot) on grapes is caused by the fungus Isariopsis cincta. This disease primarily affects grapevine leaves, leading to dark, angular lesions that are initially small, brown, and water-soaked in appearance. Over time, these lesions enlarge, often forming irregular, sunken spots with distinct yellow halos. As the disease progresses, the affected leaves may yellow, die off, or fall prematurely, reducing the plant's ability to photosynthesize and potentially leading to reduced vine vigor and yield.Isariopsis leaf spot typically thrives in humid conditions and is spread by wind, rain, and insect activity, which help disperse fungal spores. The disease is most damaging during the growing season when the fungus infects leaves through wounds, such as those caused by pruning or hail damage. It can also spread through infected pruning tools or other vineyard equipment.", 
"Grape___healthy" : "Healthy Grape Vines exhibit strong, vigorous growth with lush green leaves, healthy stems, and a good fruit set. The leaves should be dark green, free from spots, discoloration, or wilting, which indicates that the vine is not stressed by pests, diseases, or nutrient deficiencies. The vines should have well-established root systems, which help support the plant by absorbing adequate water and nutrients. Healthy grapes will also produce clusters of ripe, firm, and blemish-free fruit.For optimal vine health, grapes require full sun for at least 6–8 hours a day. They prefer well-drained, slightly acidic to neutral soil (pH 6.0–7.5). Regular watering is necessary, especially during dry spells, but the soil should never be waterlogged, as this can lead to root rot. A balanced fertilizer, especially one rich in potassium and phosphorus, promotes healthy growth and good fruit production.", 
"Orange___Haunglongbing_(Citrus_greening)" : "Huanglongbing (HLB), also known as citrus greening, is a devastating bacterial disease caused by Candidatus Liberibacter spp. It primarily affects citrus trees, including oranges, and is spread by the Asian citrus psyllid (an insect vector). Symptoms of HLB include yellowing of leaves, which often appears in a blotchy pattern or as veins remaining green while the surrounding tissue turns yellow. This results in a 'zebra striping' effect on the leaves. Affected trees often show stunted growth, poor fruit development, and asymmetrical, misshapen fruit with a bitter taste. Infected trees may eventually die if left untreated. HLB is incurable, but management strategies focus on controlling the psyllid vector with insecticides, using resistant rootstocks, and removing infected trees to prevent further spread.", 
"Peach___Bacterial_spot" : "Bacterial spot on peaches is caused by Xanthomonas arboricola pv. pruni. This disease is characterized by the appearance of small, dark, water-soaked spots on the leaves, which later turn brown and often lead to tissue necrosis. The lesions may coalesce, causing large areas of leaf tissue to die. On fruit, the spots are often sunken, leading to premature fruit drop or reduced fruit quality. Bacterial spot thrives in warm, wet conditions and spreads through rain, irrigation, and infected plant debris. Management includes the use of resistant peach varieties, removing infected plant material, applying bactericides during periods of high infection risk, and practicing good orchard sanitation.", 
"Peach___healthy" : "Healthy peach trees exhibit vigorous growth, with large, glossy, dark green leaves, and strong branches. The tree should be free of visible signs of disease, pests, or nutrient deficiencies. Healthy peach trees produce well-formed, firm fruit, which is free from blemishes or discoloration. For optimal health, peaches require full sun and well-drained, slightly acidic soil with a pH between 6.0 and 7.0. Regular watering is essential, especially during dry spells, but care should be taken not to overwater. Proper pruning encourages good airflow, reduces the risk of diseases like peach leaf curl, and enhances fruit quality. A balanced fertilizer with the right nutrients supports healthy growth, and pest control practices, such as monitoring for aphids or fruit flies, are important to protect the tree.", 
"Pepper,_bell___Bacterial_spot" : "Bacterial spot on bell peppers is caused by Xanthomonas campestris pv. vesicatoria. This disease is characterized by the appearance of water-soaked, angular lesions on the leaves, which turn yellow and eventually brown. These spots often have a greasy appearance and can spread to stems and fruit, causing lesions that can lead to fruit rot and a decrease in quality. The disease is favored by warm, wet conditions and is spread through rain, irrigation, contaminated tools, and plant debris. Management includes planting resistant varieties, practicing crop rotation, removing infected plant material, and applying copper-based bactericides or other treatments during high-risk periods. Proper field sanitation is key to minimizing disease spread.", 
"Pepper,_bell___healthy" : "Healthy bell pepper plants are characterized by strong, upright growth with vibrant green, smooth leaves and a robust stem structure. The plants should be free from wilting, discoloration, or deformities. Healthy peppers will produce firm, thick-walled fruits that are free from blemishes or rot. To maintain optimal health, bell peppers require full sun (at least 6 hours per day) and well-drained soil rich in organic matter. They thrive in slightly acidic to neutral soil (pH 6.0 to 7.0) and need regular watering, especially during fruit development, but soil should not be soggy. Fertilizing with a balanced, nitrogen-rich fertilizer encourages strong growth, and proper spacing ensures good air circulation to reduce the risk of disease.", 
"Potato___Early_blight" : "Early blight on potatoes is caused by the fungus Alternaria solani. This disease is characterized by dark, circular lesions with concentric rings on the leaves, which later cause the tissue to die and turn brown. The lesions may merge, leading to extensive defoliation and reduced photosynthesis. Early blight can affect both the foliage and tubers, leading to smaller, lower-quality potatoes. The disease thrives in warm, wet conditions and is spread by wind, rain, and contaminated tools. To manage early blight, use resistant potato varieties, practice crop rotation, and remove infected plant debris. Fungicide applications during the growing season, especially when conditions are favorable for disease, can help reduce the spread.", 
"Potato___Late_blight" : "Late blight on potatoes, caused by the oomycete Phytophthora infestans, is one of the most destructive diseases of potatoes. Symptoms include dark, water-soaked lesions on leaves, stems, and tubers, which can rapidly spread, causing large areas of the plant to die. Infected tubers may develop a brown rot, making them unsuitable for consumption or storage. Late blight thrives in cool, moist conditions and can spread quickly, leading to devastating crop loss if not controlled. Management involves planting resistant varieties, removing infected plant material, practicing crop rotation, and applying fungicides at key times during the growing season. Proper field sanitation and avoiding overhead irrigation can help reduce the risk of infection.", 
"Potato___healthy" : "Healthy potato plants exhibit strong, upright growth with lush, dark green leaves and robust stems. The plants should be free from wilting, discoloration, or any signs of pest or disease damage. Healthy potatoes will produce well-formed, firm tubers, with smooth skin and no signs of rot or scab. For optimal growth, potatoes require well-drained, loose, slightly acidic soil with a pH between 5.8 and 6.5. Full sun is essential, and the plants should be watered consistently to keep the soil moist but not waterlogged. Fertilization with a balanced fertilizer promotes healthy growth and good tuber development. Proper spacing ensures good airflow, reducing the risk of fungal infections like early and late blight.", 
"Raspberry___healthy" : "Healthy raspberry plants are vigorous, with strong, upright canes and abundant green leaves. The leaves should be bright and free of yellowing, spots, or wilting. Healthy raspberry canes will be free from disease symptoms, such as rust, canker, or insect damage. Fruit should be firm, free from mold, and ripen evenly. Raspberries thrive in well-drained, slightly acidic soil (pH 5.5 to 6.5) and require full sunlight for at least 6 hours per day. Regular watering, particularly during fruiting, is essential, but the soil should not stay waterlogged. Pruning to remove old canes and improve air circulation helps prevent disease, and maintaining good spacing between plants ensures healthy growth.", 
"Soybean___healthy" : "Healthy soybean plants are characterized by strong, erect stems, vibrant green leaves, and no signs of disease or pest damage. The leaves should be smooth, without any yellowing, spots, or deformed areas. Healthy soybean plants will produce well-formed, green pods with plump beans. Soybeans thrive in well-drained, fertile soils with a slightly acidic to neutral pH (6.0–7.0) and require full sun for optimal growth. Regular watering is necessary, especially during pod formation, but soil should not be overly wet. Proper spacing between plants ensures good air circulation, reducing the risk of fungal diseases. Applying balanced fertilizers and practicing crop rotation can help maintain healthy plants and soil.", 
"Squash___Powdery_mildew" : "Powdery mildew on squash is caused by fungal pathogens such as Erysiphe cichoracearum or Sphaerotheca fuliginea. This disease appears as a white, powdery coating on the upper surfaces of leaves, stems, and fruit. As the disease progresses, leaves can become distorted, yellow, and eventually die. Powdery mildew thrives in warm, dry conditions with high humidity and can spread quickly through the garden via windborne spores. Managing powdery mildew involves using resistant varieties, removing infected plant material, and applying fungicides, especially during early signs of infection. Providing proper spacing for good air circulation, avoiding overhead irrigation, and pruning can also help reduce the spread of the disease.", 
"Strawberry___Leaf_scorch" : "Leaf scorch in strawberries is a condition often caused by environmental stress factors, such as drought, excessive heat, or nutrient imbalances. It is characterized by the browning or yellowing of leaf edges, which may progress inward, causing the entire leaf to die. In some cases, the affected leaves may have dry, crispy margins, leading to a burnt appearance. Leaf scorch can also be caused by fungal or bacterial infections, especially when plants are stressed. To prevent leaf scorch, ensure strawberries receive consistent watering, particularly during dry periods, and apply mulch to retain moisture in the soil. Ensuring proper spacing and air circulation around plants reduces stress and disease risk, while proper fertilization helps promote healthy, vigorous growth.", 
"Strawberry___healthy" : "Healthy strawberry plants are characterized by vibrant, dark green leaves, strong runners, and healthy, firm fruit. The leaves should be smooth, free of spots, discoloration, or wilting, and the plant should show no signs of disease or pest damage. Healthy strawberries produce sweet, plump fruit that is uniform in color, free from blemishes, and ripens evenly. For optimal growth, strawberries require well-drained, slightly acidic soil (pH 5.5–6.5) and full sun for at least 6 hours per day. They should be watered regularly, especially during dry periods, but the soil should never become waterlogged. Proper spacing between plants helps improve airflow, reducing the risk of fungal diseases like powdery mildew and leaf spot. Regular mulching helps retain moisture and keep the soil temperature stable.", 
"Tomato___Bacterial_spot" : "Bacterial spot on tomatoes is caused by Xanthomonas campestris pv. vesicatoria. This disease is characterized by dark, angular lesions on the leaves that expand and turn yellow around the edges. These lesions often develop a yellow halo and can spread to stems and fruit, causing soft, sunken spots. Affected plants may experience defoliation and reduced fruit quality, which can lead to yield loss. Bacterial spot thrives in warm, wet conditions and spreads through water, contaminated tools, and infected plant material. Management includes using resistant tomato varieties, crop rotation, removing infected plant debris, and applying copper-based bactericides or other appropriate treatments during high-risk periods.", 
"Tomato___Early_blight" : "Early blight on tomatoes is caused by the fungus Alternaria solani. It is characterized by dark, circular lesions with concentric rings on the lower leaves of the plant. These lesions eventually enlarge, causing the leaves to turn yellow and die. Early blight can reduce the plant's ability to photosynthesize, leading to stunted growth and smaller fruit. The fungus thrives in warm, moist conditions and can spread rapidly through rain, wind, and contaminated tools. Management includes using resistant varieties, practicing crop rotation, removing infected plant material, and applying fungicides at key times during the growing season to prevent infection.", 
"Tomato___Late_blight" : "Late blight on tomatoes is caused by Phytophthora infestans, a highly destructive oomycete pathogen. Symptoms include dark, water-soaked lesions on the leaves, which can rapidly spread, causing large areas of the plant to die. Affected fruit may become brown and rot, often with a foul odor. Late blight is favored by cool, moist conditions and spreads quickly, often resulting in rapid plant collapse. Management includes planting resistant varieties, removing infected plants, and applying fungicides during periods of high risk. Preventing overhead irrigation and maintaining good airflow can also help reduce the risk of late blight.", 
"Tomato___Leaf_Mold" : "Leaf mold in tomatoes is caused by the fungus Cladosporium fulvum. The disease is characterized by yellowing and curling of the upper leaves, with a dense, grayish mold appearing on the underside of the leaves. Over time, the affected leaves may die, leading to reduced photosynthesis and stunted growth. Leaf mold thrives in warm, humid conditions and can spread rapidly under these conditions. It is primarily spread by spores that are carried by wind, water, and contaminated tools. Managing leaf mold involves selecting resistant tomato varieties, improving air circulation around the plants, and applying fungicides to reduce spore spread. Pruning affected leaves and avoiding overhead irrigation also helps manage humidity around the plants.", 
"Tomato___Septoria_leaf_spot" : "Septoria leaf spot on tomatoes is caused by the fungus Septoria lycopersici. The disease is characterized by small, dark, circular lesions with pale centers on the lower leaves of the plant. These lesions enlarge over time and cause the leaves to yellow and eventually die. As the disease progresses, it can cause significant defoliation, weakening the plant and reducing its ability to photosynthesize. This leads to stunted growth and poor fruit production. Septoria leaf spot thrives in warm, moist conditions and spreads rapidly through rain, irrigation, and contaminated tools. Management includes removing and destroying infected plant material, practicing crop rotation, using resistant varieties, and applying fungicides during periods of high infection risk.", 
"Tomato___Spider_mites Two-spotted_spider_mite" : "The two-spotted spider mite (Tetranychus urticae) is a common pest of tomato plants. These tiny, sap-sucking arachnids cause yellowing, stippling, or speckling of the leaves, which can eventually lead to leaf drop. Spider mite infestations can also cause fine webbing on the undersides of leaves. The mites thrive in hot, dry conditions and can multiply rapidly, especially under stress. In severe cases, spider mites can cause significant damage to the plant, reducing photosynthesis and stunting growth. Management includes introducing natural predators like ladybugs, applying miticides, and using water sprays to dislodge the mites from the plant. Maintaining proper irrigation and avoiding plant stress can also reduce the risk of infestation.", 
"Tomato___Target_Spot" : "Target spot on tomatoes is caused by the fungus Corynespora cassiicola. This disease is characterized by the appearance of dark, circular spots with concentric rings, giving a target-like appearance, on the leaves. Over time, the lesions expand and can cause the tissue around them to yellow. Target spot can lead to premature defoliation, reducing the plant’s ability to photosynthesize and decreasing yield. It thrives in humid, warm conditions and spreads through wind, rain, and contaminated tools. To manage target spot, use resistant varieties, remove infected plant material, apply fungicides as needed, and practice good sanitation to reduce the spread of the pathogen.", 
"Tomato___Tomato_Yellow_Leaf_Curl_Virus" : "Tomato Yellow Leaf Curl Virus (TYLCV) is a viral disease transmitted by the whitefly (Bemisia tabaci). Symptoms include yellowing and curling of the upper leaves, stunted growth, and a general reduction in plant vigor. Infected plants may show wilting and poor fruit development, leading to reduced yield and fruit quality. TYLCV can spread rapidly in fields or gardens infested with whiteflies, and the virus itself has no cure. Management strategies include using resistant tomato varieties, controlling whitefly populations with insecticides or biological control agents, and removing infected plants to reduce the spread of the virus.", 
"Tomato___Tomato_mosaic_virus" : "Tomato Mosaic Virus (ToMV) is a viral infection that affects tomatoes, causing symptoms such as mottling or discoloration on leaves, stunted growth, and distorted fruit. The virus is spread through physical contact, contaminated tools, or infected seeds. Infected plants often show mosaic-like patterns on the leaves, which can affect plant vigor and lead to poor fruit production. There is no cure for ToMV once plants are infected. Management includes using resistant varieties, avoiding mechanical transmission (e.g., by disinfecting tools), and removing and destroying infected plants. Proper crop rotation and using certified virus-free seeds can help prevent the disease.", 
"Tomato___healthy" : "Healthy tomato plants are characterized by robust, upright growth, vibrant green leaves, and strong stems. The plants should be free from yellowing, wilting, or signs of disease or pest damage. Healthy tomatoes will produce plump, firm fruit that is free from blemishes and ripens evenly. To maintain optimal health, tomatoes require well-drained, fertile soil with a slightly acidic pH (6.0–6.8), and full sun for at least 6–8 hours per day. Regular watering is essential, particularly during fruiting, but the soil should never be waterlogged. Proper spacing and pruning to improve airflow help reduce the risk of fungal diseases, and balanced fertilization supports healthy plant growth. Monitoring for pests like aphids, whiteflies, and tomato hornworms can prevent infestations and keep plants thriving."
}